"use strict";

6.1;

let $title6_1 = document.createElement("h2");
$title6_1.innerHTML =
  `1. Создать массив «Список покупок». Каждый элемент массива является объектом, который содержит название продукта, необходимое количество и куплен или нет. Написать несколько функций для работы с таким массивом.

  Вывод всего списка на экран таким образом, чтобы сначала шли некупленные продукты, а потом – купленные.
  Добавление покупки в список. Учтите, что при добавлении покупки с уже существующим в списке продуктом, необходимо увеличивать количество в существующей покупке, а не добавлять новую.
  Покупка продукта. Функция принимает название продукта и отмечает его как купленный.`;
document.body.append($title6_1);

